app/src/main/JsonArray.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <MySoapHeader xmlns="http://tempuri.org/">
            <UserID>string</UserID>
            <PassWord>string</PassWord>
        </MySoapHeader>
    </soap:Header>
    <soap:Body>
        <GetTable xmlns="http://tempuri.org/">
            <id>string</id>
            <sql>string</sql>
        </GetTable>
    </soap:Body>
</soap:Envelope>